{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [1, 1], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense_1/bias"}]}], "modelTopology": {"training_config": {"loss": "mean_squared_error", "loss_weights": null, "metrics": [], "optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "learning_rate": 0.009999999776482582, "name": "SGD", "momentum": 0.0, "decay": 0.0}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.4-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "batch_input_shape": [null, 1], "use_bias": true, "activity_regularizer": null}}], "name": "sequential_1"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.6.0", "format": "layers-model"}